gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
            watchdog_message_maple("Invalid code for LED on!\r\n", BPACKET_CODE_ERROR);

            break;

        case WATCHDOG_BPK_R_LED_RED_OFF:

            if (bpacket->code == BPACKET_CODE_EXECUTE) {
                watchdog_create_and_send_bpacket_to_esp32(WATCHDOG_BPK_R_LED_RED_OFF, BPACKET_CODE_EXECUTE, 0, NULL);
                break;
            }

            if (bpacket->code == BPACKET_CODE_SUCCESS) {
                watchdog_report_success(WATCHDOG_BPK_R_LED_RED_OFF);
                break;
            }

            watchdog_message_maple("Invalid code for LED off!\r\n", BPACKET_CODE_ERROR);

            break;

        case BPACKET_GEN_R_PING:

            if (bpacket->code == BPACKET_CODE_EXECUTE) {
                uint8_t ping = WATCHDOG_PING_CODE_STM32;
                watchdog_create_and_send_bpacket_to_maple(BPACKET_GEN_R_PING, BPACKET_CODE_SUCCESS, 1, &ping);
                break;
            }

            watchdog_message_maple("Invalid code for Ping!\r\n", BPACKET_CODE_ERROR);

            break;

        case BPACKET_GEN_R_MESSAGE:
            log_send_bdata(bpacket->bytes, bpacket->numBytes);
            break;

        default:;
            char bpacketInfo[80];
            bpacket_get_info(bpacket, bpacketInfo);
            char errorMsg[100];
            sprintf(errorMsg, "Unknown request: %s\r\n", bpacketInfo);
            watchdog_message_maple(errorMsg, BPACKET_CODE_ERROR);
    }
}

uint8_t stm32_match_esp32_request(bpacket_t* bpacket) {

    switch (bpacket->request) {

        case WATCHDOG_BPK_R_TAKE_PHOTO: // ESP32 Response to request from STM32 to take a photo

            if (bpacket->code == BPACKET_CODE_SUCCESS) { // Photo was succesfully taken

#ifdef DEBUG
                watchdog_report_success(WATCHDOG_BPK_R_TAKE_PHOTO);
#endif

                // TODO: Need to update RTC Alarm
                watchdog_message_maple("Need to update RTC alarm\r\n\0", BPACKET_CODE_TODO);
                break;
            }

            // If photo could not be taken, print error code to Maple
            if (bpacket->code == BPACKET_CODE_ERROR) {
                watchdog_create_and_send_bpacket_to_maple(WATCHDOG_BPK_R_TAKE_PHOTO, BPACKET_CODE_ERROR,
                                                          bpacket->numBytes, bpacket->bytes);
                break;
            }

            break;

        case WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS:

            // Log success to Maple
            if (bpacket->code == BPACKET_CODE_SUCCESS) {

                // Store watchdog settings in struct
                uint8_t result = wd_bpacket_to_capture_time_settings(bpacket, &captureTime);

                if (result != TRUE) {
                    watchdog_message_maple("Failed to convert bpacket to settings\r\n", BPACKET_CODE_ERROR);
                    break;
                }

                // Report success
                watchdog_report_success(WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS);
                break;
            }

            // If reading the watchdog settings fails, keep default settings
            if (bpacket->code == BPACKET_CODE_ERROR) {
                watchdog_message_maple("Failed to read Watchdog settings\r\n", BPACKET_CODE_ERROR);
                break;
            }

            watchdog_message_maple("ESP32 returned unknown code when request to get wd settings", BPACKET_CODE_ERROR);

            break;

        case WATCHDOG_BPK_R_SET_CAPTURE_TIME_SETTINGS:

            // Log success to Maple
            if (bpacket->code == BPACKET_CODE_SUCCESS) {
                watchdog_report_success(WATCHDOG_BPK_R_SET_CAPTURE_TIME_SETTINGS);

                // Request read of capture time from ESP32 to update the settings on the STM32
                watchdog_create_and_send_bpacket_to_esp32(WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS,
                                                          BPACKET_CODE_EXECUTE, 0, NULL);
                break;
            }

            // Log failure to Maple
            if (bpacket->code == BPACKET_CODE_ERROR) {
                watchdog_message_maple("Failed to write settings to ESP32", BPACKET_CODE_ERROR);
            }

            watchdog_message_maple("ESP32 returned invalid code when udpating wd settings", BPACKET_CODE_ERROR);

            break;

        default:
            return FALSE;
    }

    return TRUE;
}

uint8_t stm32_match_maple_request(bpacket_t* bpacket) {

    bpacket_buffer_t bpacketBuffer;
    uint8_t request = bpacket->request;
    uint8_t result;

    switch (bpacket->request) {

        case WATCHDOG_BPK_R_TAKE_PHOTO: // Send command to ESP32 to take a photo

            // Record the current temperature from both temperature sensors
            if (ds18b20_read_temperature(DS18B20_SENSOR_ID_1) != TRUE) {
                watchdog_message_maple("Failed to read temperature", BPACKET_CODE_ERROR);
            }

            ds18b20_temp_t temp1;
            if (ds18b20_copy_temperature(DS18B20_SENSOR_ID_1, &temp1) != TRUE) {
                watchdog_message_maple("Failed to copy temperature", BPACKET_CODE_ERROR);
            }

            if (ds18b20_read_temperature(DS18B20_SENSOR_ID_2) != TRUE) {
                watchdog_message_maple("Failed to read temperature", BPACKET_CODE_ERROR);
            }

            ds18b20_temp_t temp2;
            if (ds18b20_copy_temperature(DS18B20_SENSOR_ID_2, &temp2) != TRUE) {
                watchdog_message_maple("Failed to copy temperature", BPACKET_CODE_ERROR);
            }

            // Update the datetime struct
            stm32_rtc_read_datetime(&datetime);

            // Get the real time clock time and date. Put it in a packet and send to the ESP32
            bpacket_t photoRequest;

            result =
                wd_photo_data_to_bpacket(&photoRequest, BPACKET_ADDRESS_ESP32, BPACKET_ADDRESS_STM32,
                                         WATCHDOG_BPK_R_TAKE_PHOTO, BPACKET_CODE_EXECUTE, &datetime, &temp1, &temp2);

            if (result == TRUE) {
                watchdog_send_bpacket_to_esp32(&photoRequest);
            } else {
                char errMsg[50];
                wd_get_error(result, errMsg);
                char msg[130];
                sprintf(msg, "Failed to convert photo data to bpacket with error: %s\r\n", errMsg);
                watchdog_message_maple(msg, BPACKET_CODE_ERROR);
            }

            break;

        case WATCHDOG_BPK_R_GET_DATETIME:

            // Get the datetime from the RTC
            stm32_rtc_read_datetime(&datetime);
            if (wd_datetime_to_bpacket(bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32, request,
                                       BPACKET_CODE_SUCCESS, &datetime) == TRUE) {
                bpacket_to_buffer(bpacket, &bpacketBuffer);
                comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);
            } else {
                watchdog_message_maple("Failed to convert datetime to bpacket\0", BPACKET_CODE_ERROR);
            }

            break;

        case WATCHDOG_BPK_R_SET_DATETIME:

