gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
            // Set the datetime using the information from the bpacket
            if (wd_bpacket_to_datetime(bpacket, &datetime) == TRUE) {
                stm32_rtc_write_datetime(&datetime);
                watchdog_report_success(WATCHDOG_BPK_R_SET_DATETIME);
            } else {
                watchdog_message_maple("Failed to convert bpacket to datetime\r\n", BPACKET_CODE_ERROR);
            }

            break;

        case WATCHDOG_BPK_R_GET_STATUS:
            watchdog_message_maple("This feature has not been implemented yet\r\n", BPACKET_CODE_TODO);
            // TODO: Implement
            break;

        case WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS:;

            // Send the watchdog settings back to maple
            bpacket_t settingsPacket;
            result = wd_capture_time_settings_to_bpacket(&settingsPacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_STM32,
                                                         WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS, BPACKET_CODE_SUCCESS,
                                                         &captureTime);

            if (result != TRUE) {
                watchdog_message_maple("Failed to convert settings to bpacket\r\n", BPACKET_CODE_ERROR);
                break;
            } else {
                watchdog_message_maple("Converted settings to bpacket. Sending to maple\r\n", BPACKET_CODE_DEBUG);
            }

            // Send the bpacket to maple
            bpacket_to_buffer(&settingsPacket, &bpacketBuffer);
            comms_transmit(MAPLE_UART, bpacketBuffer.buffer, bpacketBuffer.numBytes);

            break;

        case WATCHDOG_BPK_R_SET_CAPTURE_TIME_SETTINGS:;

            // Update the bpacket addresses to redirect the request to the ESP32
            bpacket->receiver = BPACKET_ADDRESS_ESP32;
            bpacket->sender   = BPACKET_ADDRESS_STM32;

            watchdog_send_bpacket_to_esp32(bpacket);

            break;

        case WATCHDOG_BPK_R_TURN_ON:
            watchdog_esp32_on();
            watchdog_create_and_send_bpacket_to_maple(WATCHDOG_BPK_R_TURN_ON, BPACKET_CODE_SUCCESS, 0, NULL);
            break;

        case WATCHDOG_BPK_R_TURN_OFF:
            watchdog_esp32_off();
            watchdog_create_and_send_bpacket_to_maple(WATCHDOG_BPK_R_TURN_OFF, BPACKET_CODE_SUCCESS, 0, NULL);
            break;

        default:
            return FALSE;
    }

    return TRUE;
}

void watchdog_update(void) {

    // // Process anything the ESP32 sends to the STM32
    // if (comms_process_rxbuffer(BUFFER_1_ID, &esp32Bpacket) == TRUE) {
    //     if (stm32_match_esp32_request(&esp32Bpacket) != TRUE) {
    //         process_watchdog_stm32_request(&esp32Bpacket);
    //     }
    // }

    // // Process anything Maple sends to the STM32
    // if (comms_process_rxbuffer(BUFFER_2_ID, &mapleBpacket) == TRUE) {
    //     if (stm32_match_maple_request(&mapleBpacket) != TRUE) {
    //         process_watchdog_stm32_request(&mapleBpacket);
    //     }
    // }
}

void watchdog_esp32_on(void) {
    ESP32_POWER_PORT->BSRR |= (0x01 << ESP32_POWER_PIN);

    // Delay for 1.5 seconds to let ESP32 startup
    HAL_Delay(1500);
}

void watchdog_esp32_off(void) {
    ESP32_POWER_PORT->BSRR |= (0x10000 << ESP32_POWER_PIN);
}